In [2]:
import numpy as np
import pandas as pd

In [3]:
data_dic = {'A':[1,2,np.nan,4,np.nan],
            'B':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'C':[11,12,13,14,15],
            'D':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic) # dataframe from a dic.

In [4]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [5]:
#we can ask if the data has null
df.isnull()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [6]:
df.notnull() #return true where not null

       A      B     C      D
0   True  False  True   True
1   True  False  True  False
2  False  False  True   True
3   True  False  True   True
4  False  False  True   True

In [7]:
df['A'].sum() #when taking the sum, nan is considered zero

7.0

In [8]:
df['A'].mean() #when taking the mean, nan is ignored

2.3333333333333335

In [12]:
df.dropna(thresh=3)

     A   B   C     D
0  1.0 NaN  11  16.0
3  4.0 NaN  14  19.0

In [10]:
#Dropna
df.dropna(axis=1)

    C
0  11
1  12
2  13
3  14
4  15

In [13]:
#we can fill na
df.fillna(value='filled')

        A       B   C       D
0       1  filled  11      16
1       2  filled  12  filled
2  filled  filled  13      18
3       4  filled  14      19
4  filled  filled  15      20

In [15]:
df  #without the inplace option set to true, the dataframe does not change

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [16]:
#fill with mean
df.fillna(value=df['A'].mean())

          A         B   C          D
0  1.000000  2.333333  11  16.000000
1  2.000000  2.333333  12   2.333333
2  2.333333  2.333333  13  18.000000
3  4.000000  2.333333  14  19.000000
4  2.333333  2.333333  15  20.000000

In [17]:
#forward fill
df.fillna(method="ffill")

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  16.0
2  2.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  4.0 NaN  15  20.0

In [18]:
#back fill
df.fillna(method='bfill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  4.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0